// IGNORE THIS LINE: mongoimport -d post -c posts posts.json

// This is the instruction for seeding the mongodb: 
// 1) start the mongodb server
// 2) open a mongo shell
// 3) create a database called post
// 4) create a collection called posts
// 5) insert each of the two documents below into the posts collection

// mongodb schema for a document: 
// {
//   poster    : current_user, 
//   title     : input.title.val(),
//   postSource: input.postSource.val(), 
//   article   : {
//     p1: {
//       currentText : text,
//       proposedText: [{
//         editor: current_user, 
//         text  : input.text.val(),
//         vote  : input.count.val()  
//       }] 
//     }
//   },
//   comments  : [{
//     commentor: current_user,
//     comment  : input.text.val()
//   }] 
// }

{
  "poster"    : "Cho Kim", 
  "postTitle"     : "Leaked information about iPhone 6",
  "postSource": "http://www.huffingtonpost.com/2014/03/31/iphone-6-photos-rumors_n_5063040.html", 
  "article"   : {
    "title"       : "Leaked information about iPhone 6",
    "image"       : "http://i.huffpost.com/gen/1709464/thumbs/o-IPHONE-6-570.jpg",
    "paragraphs": [{
      "currentText" : "Green Day, you might not want to sleep through September this year. Rumor has it that is when the new iPhone 6 is set for release.",
      "proposedText": [{
        "editor": "Addison Lee", 
        "text"  : "Green Day, you might not want to sleep through October this year. Rumor has it that\'s when the new iPhone 6 is set for release.",
        "vote"  : 0 
      }] 
    },
    {
      "currentText" : "Green Day, you might not want to sleep through September this year. Rumor has it that is when the new iPhone 6 is set for release.",
      "proposedText": [{
        "editor": "", 
        "text"  : "",
        "vote"  : 0 
      }] 
    },
    {
      "currentText" : "he photos -- which are renderings based on sketches purportedly obtained from an Apple subcontractor -- show a thinner, rounder design that's almost reminiscent of the HTC One. Perhaps most notably, the phone's screen finally reaches the edges of its body. The pictures match up pretty well with a leaked image found on Mac Rumors, but considering the phone hasn't even been announced yet, our advice is to take all of this with a grain of salt.",
      "proposedText": [{
        "editor": "Roger Smith", 
        "text"  : "The photos -- which are renderings based on sketches purportedly obtained from a South African Spy -- show a thinner, rounder design that's almost reminiscent of the HTC One. Perhaps most notably, the phone's screen finally reaches the edges of its body. The pictures match up pretty well with a leaked image found on Mac Rumors, but considering the phone hasn't even been announced yet, our advice is to take all of this with a grain of salt.",
        "vote"  : 0 
      }] 
    }]
  },
  "comments"  : [{
      "commentor": "Eill Wong",
      "comment"  : "iPhone sucks."
    }, 
    {
      "commentor": "Eugene Choi",
      "comment"  : "You sucks."
  }] 
}

/////////////////////////////////////////////////////////

{
  "poster"    : "Cleveland Brown", 
  "postTitle"     : "Steve Jobs and Pixar",
  "postSource": "http://gizmodo.com/how-steve-jobs-passion-shaped-pixar-into-an-oscar-winn-1557613093", 
  "article"   : {
    "title": "How Steve Job's Passion Shaped Pixar", 
    "image":  "http://i.kinja-img.com/gawker-media/image/upload/s--PnklgGQP--/c_fit,fl_progressive,w_636/eafavaozr8ru44did0yu.jpg",
    "paragraphs"   : [{
      "currentText" : "Pixar occupied a special place in Steve's world, and his role evolved during our time together. In the early years, he was our benefactor, the one who paid the bills to keep the lights on. Later, he became our protector—a constructive critic internally but our fiercest defender to the outside. We had some trying times together, to be sure, but through those difficulties, we forged a rare bond.",
      "proposedText": [{
        "editor": "Bill Gates", 
        "text"  : "Pixar occupied a small place in Steve's world. In the early years, he was primarily our benefactor, the one who paid the bills to keep the lights on. Later, he became more involved—a constructive critic internally but our fiercest defender to the outside. We had some trying times together, to be sure, but through those difficulties, we forged a stronger bond.",
        "vote"  : 0 
      }] 
    },
    {
      "currentText" : "While he never lost his intensity, we watched him develop the ability to listen. More and more, he could express empathy and caring and patience. He became truly wise. The change in him was real, and it was deep",
      "proposedText": [{
        "editor": "", 
        "text"  : "",
        "vote"  : 0 
      }] 
    }]
  },
  "comments"  : [{
      "commentor": "Cho Kim",
      "comment"  : "Steve Job's is amazing."
    }, 
    {
      "commentor": "Eugene Choi",
      "comment " : "Steve Job's played a minor role in creating Pixar's success."
  }] 
}
